org/roam/bootloaders.org
:PROPERTIES:
:ID:       20556f17-762b-4534-befa-34dbd8d2ca33
:END:
#+title: bootloaders
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Bootloaders
** notes
- microcode update loading is usually built into the initramfs
  - https://github.com/chip-red-pill/MicrocodeDecryptor for intel
** [[id:2cb4f96f-cfaa-49ad-8eb0-b93e095ba7cb][grub]]
** uefi
- efibootmgr for creating entries for stub kernels
*** secureboot
- some vendors require [[https://mjg59.dreamwidth.org/60248.html][micro$haft cert signed]] bootloader shims
  - remote attestation with TPM next
** libreboot
- coreboot with blobs removed for foss bios/uefi firmaware
