bootloaders.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>bootloaders</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org41fe2fc">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org06fe3ad" class="outline-2">
<h2 id="org06fe3ad">Bootloaders</h2>
<div class="outline-text-2" id="text-org06fe3ad">
</div>
<div id="outline-container-org9819cb5" class="outline-3">
<h3 id="org9819cb5">notes</h3>
<div class="outline-text-3" id="text-org9819cb5">
<ul class="org-ul">
<li>microcode update loading is usually built into the initramfs
<ul class="org-ul">
<li><a href="https://github.com/chip-red-pill/MicrocodeDecryptor">https://github.com/chip-red-pill/MicrocodeDecryptor</a> for intel</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9c48a55" class="outline-3">
<h3 id="org9c48a55"><a href="grub.html#ID-2cb4f96f-cfaa-49ad-8eb0-b93e095ba7cb">grub</a></h3>
</div>
<div id="outline-container-org2e1d1bc" class="outline-3">
<h3 id="org2e1d1bc">uefi</h3>
<div class="outline-text-3" id="text-org2e1d1bc">
<ul class="org-ul">
<li>efibootmgr for creating entries for stub kernels</li>
</ul>
</div>
<div id="outline-container-orgffc3d4c" class="outline-4">
<h4 id="orgffc3d4c">secureboot</h4>
<div class="outline-text-4" id="text-orgffc3d4c">
<ul class="org-ul">
<li>some vendors require <a href="https://mjg59.dreamwidth.org/60248.html">micro$haft cert signed</a> bootloader shims
<ul class="org-ul">
<li>remote attestation with TPM next</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb3fc453" class="outline-3">
<h3 id="orgb3fc453">libreboot</h3>
<div class="outline-text-3" id="text-orgb3fc453">
<ul class="org-ul">
<li>coreboot with blobs removed for foss bios/uefi firmaware</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
